{
  "_name_or_path": "vit-MINC-2500",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "brick",
    "1": "carpet",
    "10": "mirror",
    "11": "other",
    "12": "painted",
    "13": "paper",
    "14": "plastic",
    "15": "polishedstone",
    "16": "skin",
    "17": "sky",
    "18": "stone",
    "19": "tile",
    "2": "ceramic",
    "20": "wallpaper",
    "21": "water",
    "22": "wood",
    "3": "fabric",
    "4": "foliage",
    "5": "food",
    "6": "glass",
    "7": "hair",
    "8": "leather",
    "9": "metal"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "brick": "0",
    "carpet": "1",
    "ceramic": "2",
    "fabric": "3",
    "foliage": "4",
    "food": "5",
    "glass": "6",
    "hair": "7",
    "leather": "8",
    "metal": "9",
    "mirror": "10",
    "other": "11",
    "painted": "12",
    "paper": "13",
    "plastic": "14",
    "polishedstone": "15",
    "skin": "16",
    "sky": "17",
    "stone": "18",
    "tile": "19",
    "wallpaper": "20",
    "water": "21",
    "wood": "22"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2"
}
